Revit API Introduction Labs
LabUtils.GetSingleSelectedElementOrPrompt Method (, Type)
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static Element GetSingleSelectedElementOrPrompt(
	UIDocument uidoc,
	Type type
)
Visual Basic (Declaration)
Public Shared Function GetSingleSelectedElementOrPrompt ( _
	uidoc As UIDocument, _
	type As Type _
) As Element
Visual C++
public:
static Element^ GetSingleSelectedElementOrPrompt(
	UIDocument^ uidoc,
	Type^ type
)
Parameters
uidoc
Type: UIDocument
type
Type: System.Type
See Also
LabUtils Class
GetSingleSelectedElementOrPrompt Overload
Labs Namespace